app/controllers/shorteners_controller.rb

SELECT "shorteners".* FROM "shorteners"
---
  def index
    @shorteners = Shortener.all

SELECT  "shorteners".* FROM "shorteners" WHERE "shorteners"."shorten_url" = $1 LIMIT $2  [["shorten_url", "v3E24e"], ["LIMIT", 1]]
---
  def original_redirect
    @shortener = Shortener.find_by_shorten_url(params['shorten_url'])

SELECT  "shorteners".* FROM "shorteners" WHERE "shorteners"."shorten_url" = $1 LIMIT $2  [["shorten_url", "\"www.google.com\""], ["LIMIT", 1]]
---
  def fetch_original_url
    @shortner = Shortener.find_by_shorten_url(params['shorten_url'].gsub("#{request.base_url}/", ''))

INSERT INTO "shorteners" ("url", "shorten_url", "created_at", "updated_at", "sanitized_url") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["url", "google.com"], ["shorten_url", "EfPZt5"], ["created_at", "2018-07-18 11:35:48.957483"], ["updated_at", "2018-07-18 11:35:48.957483"], ["sanitized_url", "http://google.com"]]
---
  def create
    @shortener = Shortener.new(shortener_params)
    @shortener.sanitize
    respond_to do |format|
      if @shortener.new_url?
        if @shortener.save

UPDATE "shorteners" SET "url" = $1, "updated_at" = $2 WHERE "shorteners"."id" = $3  [["url", "https://google.com"], ["updated_at", "2018-07-18 11:51:47.577959"], ["id", 5]]
---
  def update
    respond_to do |format|
      if @shortener.update(shortener_params)

DELETE FROM "shorteners" WHERE "shorteners"."id" = $1  [["id", 2]]
---
  def destroy
    if @shortener.present?
      @shortener.destroy

SELECT  "shorteners".* FROM "shorteners" WHERE "shorteners"."id" = $1 ORDER BY "shorteners"."id" DESC LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
    def set_shortener
      @shortener = Shortener.where(id: params[:id]).last